namespace ZarmallStore.Data.DTOs.PaymentDto
{
    public static class PaymentStatus
    {
        public static string GetStatusMessage(string status)
        {
            switch (status)
            {
                case "100":
                    return "عملیات موفقیت بود";
                case "101":
                    return "عملیات پرداخت موفق بوده و قبلا تاییدیه تراكنش انجام شده است";
                case "-1":
                    return "بروز خطای عمومی - رد درخواست بر اساس اعتبار سنجی اولیه (توضیحات بیشتر در پارامتر errors)";
                case "-101":
                    return "كد پذیرنده وارد شده نامعتبر یا غیرفعال است";
                case "-102":
                    return "ip سرور درخواست دهنده معتبر نمیباشد";
                case "-103":
                    return "آدرس بازگشتی با آدرس درگاه پرداخت ثبت شده همخوانی ندارد";
                case "-104":
                    return "مبلغ ارسال شده صحیح نمیباشد";
                case "-105":
                    return "مجموع مبلغ تراكنش و كارمزد نباید بیش از 1.000.000.000 ریال باشد";
                case "-106":
                    return "شماره كارت ارسالی معتبر نمیباشد";
                case "-107":
                    return "وبسرویس مقصد جهت اتصال معتبر نمیباشد لطفا با پشتیبانی در ارتباط باشید";
                case "-108":
                    return "بروز خطای سیستمی - ایجاد تراكنش با خطا مواجه شد";
                case "-109":
                    return "مقدار authority معتبر نبوده و یا با كد پذیرنده شما مطابقت ندارد";
                case "-110":
                    return "مبلغ ارسال شده برای تاییدیه با مبلغ تراكنش یکسان نیست";
                case "-111":
                    return "تراكنش در انتظار پرداخت میباشد";
                case "-112":
                    return "تراكنش ناموفق بوده و امکان تایید آن وجود ندارد";
                case "-113":
                    return "مدت زمان تایید تراكنش به اتمام رسیده و مبلغ به حساب پرداخت كننده برگشت خواهد خورد";
                case "-114":
                    return "تراكنش به حساب پرداخت كننده مرجوع شده است";
                case "-115":
                    return "سشن ایجاد شده جهت پرداخت منقضی شده است";
                case "-116":
                    return "بروز خطای بانکی – وریفای تراكنش از سمت بانك رد شد";
                case "-117":
                    return "ارسال شماره كارت جهت پرداخت الزامی میباشد ( در برخی درگاه ها با هماهنگی پشتیبانی نوینو، ارسال شماره كارت الزامی میباشد. )";
            }

            return "";
        }
    }
}
